import {Injectable} from '@angular/core';

@Injectable({
   providedIn: 'root'
})
export class InitialState {
   constructor() {}

   parameters = [
      {
         code: 'Pi',
         name: 'Діагностичний спектр і-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Pj',
         name: 'Діагностичний спектр j-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Sei',
         name: 'Чутливість і-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Sej',
         name: 'Чутливість j-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Spi',
         name: 'Специфічність і-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Spj',
         name: 'Специфічність j-того тесту',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Utp',
         name: 'Корисність дійснопозитивного результату',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Ufp',
         name: 'Корисність хибнопозитивного результату',
         minAllowed: -1,
         maxAllowed: 0,
      },
      {
         code: 'Utn',
         name: 'Корисність дійснонегативного результату',
         minAllowed: 0,
         maxAllowed: 1,
      },
      {
         code: 'Ufn',
         name: 'Корисність хибнонегативного результату',
         minAllowed: -1,
         maxAllowed: 0,
      }
   ];

   strategies = [
      {
         id: 0,
         name: 'Одна діагностична технологія'
      },
      {
         id: 1,
         name: 'Діагностичні спектри рівні, верифікація негативного результату і-того тесту'
      },
      {
         id: 2,
         name: 'Діагностичні спектри рівні, верифікація позитивного результату і-того тесту'
      },
      {
         id: 3,
         name: 'Діагностичні спектри різні і не перетинаються, верифікація негативного результату і-того тесту'
      },
      {
         id: 4,
         name: 'Діагностичні спектри різні і не перетинаються, верифікація позитивного результату і-того тесту'
      },
      {
         id: 5,
         name: 'Діагностичний спектр j-того тесту входить до діагностичного спектру і-того тесту, верифікація негативного результату і-того тесту'
      },
      {
         id: 6,
         name: 'Діагностичний спектр j-того тесту входить до діагностичного спектру і-того тесту, верифікація позитивного результату і-того тесту'
      },
      {
         id: 7,
         name: 'Діагностичний спектр і-того тесту входить до діагностичного спектру j-того тесту, верифікація негативного результату і-того тесту'
      },
      {
         id: 8,
         name: 'Діагностичний спектр і-того тесту входить до діагностичного спектру j-того тесту, верифікація позитивного результату і-того тесту'
      },
      {
         id: 9,
         name: 'Діагностичні спектри частково перетинаються, верифікація негативного результату і-того тесту'
      },
      {
         id: 10,
         name: 'Діагностичні спектри частково перетинаються, верифікація позитивного результату і-того тесту'
      },
      {
         id: 11,
         name: 'Паралельна діагностика (діагностичні спектри частково перетинаються)'
      },

   ];
}
